jmeter/report/statistics.json
{
  "GET Provedores" : {
    "transaction" : "GET Provedores",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 98.24800000000006,
    "medianResTime" : 89.0,
    "minResTime" : 86.0,
    "maxResTime" : 359.0,
    "pct1ResTime" : 113.0,
    "pct2ResTime" : 147.89999999999998,
    "pct3ResTime" : 205.84000000000015,
    "throughput" : 4.543719670671198,
    "receivedKBytesPerSec" : 5.755082434434125,
    "sentKBytesPerSec" : 1.6417737091292415
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 501,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 99.27145708582839,
    "medianResTime" : 92.0,
    "minResTime" : 86.0,
    "maxResTime" : 359.0,
    "pct1ResTime" : 112.0,
    "pct2ResTime" : 146.19999999999982,
    "pct3ResTime" : 202.9000000000001,
    "throughput" : 4.281868296226658,
    "receivedKBytesPerSec" : 5.16551108926969,
    "sentKBytesPerSec" : 1.5444301926199735
  },
  "GET Productos" : {
    "transaction" : "GET Productos",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 99.60399999999998,
    "medianResTime" : 93.0,
    "minResTime" : 90.0,
    "maxResTime" : 213.0,
    "pct1ResTime" : 110.80000000000001,
    "pct2ResTime" : 130.69999999999993,
    "pct3ResTime" : 193.82000000000016,
    "throughput" : 4.213080773184584,
    "receivedKBytesPerSec" : 4.842574287146733,
    "sentKBytesPerSec" : 1.5181902395557727
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 272.0,
    "medianResTime" : 272.0,
    "minResTime" : 272.0,
    "maxResTime" : 272.0,
    "pct1ResTime" : 272.0,
    "pct2ResTime" : 272.0,
    "pct3ResTime" : 272.0,
    "throughput" : 3.676470588235294,
    "receivedKBytesPerSec" : 1.4217601102941175,
    "sentKBytesPerSec" : 1.051958869485294
  }
}