jmeter/report/statistics.json
{
  "GET Provedores" : {
    "transaction" : "GET Provedores",
    "sampleCount" : 250,
    "errorCount" : 10,
    "errorPct" : 4.0,
    "meanResTime" : 1320.1400000000006,
    "medianResTime" : 95.5,
    "minResTime" : 88.0,
    "maxResTime" : 31150.0,
    "pct1ResTime" : 167.0000000000001,
    "pct2ResTime" : 247.45,
    "pct3ResTime" : 30654.690000000002,
    "throughput" : 2.8800516105248604,
    "receivedKBytesPerSec" : 3.5313257813580017,
    "sentKBytesPerSec" : 1.040643648334178
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 501,
    "errorCount" : 10,
    "errorPct" : 1.996008,
    "meanResTime" : 708.5888223552896,
    "medianResTime" : 94.0,
    "minResTime" : 87.0,
    "maxResTime" : 31150.0,
    "pct1ResTime" : 123.0,
    "pct2ResTime" : 176.0,
    "pct3ResTime" : 30377.380000000005,
    "throughput" : 3.3740100210117987,
    "receivedKBytesPerSec" : 4.002164737217822,
    "sentKBytesPerSec" : 1.2169741304852917
  },
  "GET Productos" : {
    "transaction" : "GET Productos",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 98.77200000000002,
    "medianResTime" : 92.0,
    "minResTime" : 87.0,
    "maxResTime" : 245.0,
    "pct1ResTime" : 114.0,
    "pct2ResTime" : 137.45,
    "pct3ResTime" : 185.92000000000007,
    "throughput" : 4.224899869873084,
    "receivedKBytesPerSec" : 4.856159323086542,
    "sentKBytesPerSec" : 1.5224492695148124
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 275.0,
    "medianResTime" : 275.0,
    "minResTime" : 275.0,
    "maxResTime" : 275.0,
    "pct1ResTime" : 275.0,
    "pct2ResTime" : 275.0,
    "pct3ResTime" : 275.0,
    "throughput" : 3.6363636363636362,
    "receivedKBytesPerSec" : 1.4062499999999998,
    "sentKBytesPerSec" : 1.0404829545454544
  }
}