jmeter/report/statistics.json
{
  "GET Provedores" : {
    "transaction" : "GET Provedores",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.55999999999996,
    "medianResTime" : 99.0,
    "minResTime" : 92.0,
    "maxResTime" : 314.0,
    "pct1ResTime" : 138.9,
    "pct2ResTime" : 181.89999999999998,
    "pct3ResTime" : 258.3700000000001,
    "throughput" : 4.138250678673111,
    "receivedKBytesPerSec" : 5.241514775624048,
    "sentKBytesPerSec" : 1.4993076189333245
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 501,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.83433133732535,
    "medianResTime" : 99.0,
    "minResTime" : 88.0,
    "maxResTime" : 331.0,
    "pct1ResTime" : 142.0,
    "pct2ResTime" : 177.79999999999995,
    "pct3ResTime" : 264.82000000000016,
    "throughput" : 3.9492976398808115,
    "receivedKBytesPerSec" : 4.764308321114947,
    "sentKBytesPerSec" : 1.4283317764744832
  },
  "GET Productos" : {
    "transaction" : "GET Productos",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.28800000000001,
    "medianResTime" : 97.0,
    "minResTime" : 88.0,
    "maxResTime" : 331.0,
    "pct1ResTime" : 144.9,
    "pct2ResTime" : 174.89999999999998,
    "pct3ResTime" : 279.0300000000004,
    "throughput" : 3.9567605210262258,
    "receivedKBytesPerSec" : 4.547956184812371,
    "sentKBytesPerSec" : 1.429688860136429
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 317.0,
    "medianResTime" : 317.0,
    "minResTime" : 317.0,
    "maxResTime" : 317.0,
    "pct1ResTime" : 317.0,
    "pct2ResTime" : 317.0,
    "pct3ResTime" : 317.0,
    "throughput" : 3.1545741324921135,
    "receivedKBytesPerSec" : 1.2199329652996844,
    "sentKBytesPerSec" : 0.9057078075709779
  }
}